#ifndef	_FONT_H_
#define	_FONT_H_
#include "71x_lib.h"
#include "flash.h"

/*******************************************************************
* 关于字库的一些宏定义
*******************************************************************/
#define	ASCII_SIZE	0X10	//一个ASCII码占的字节数

/*******************************************************************
函数名称:   find_chinese
功能描述:   在中文字库中寻找中文字符
*******************************************************************/
void find_chinese(u32 address);

/*******************************************************************
函数名称:find_chinese
功能描述:在ASCII库中寻找ASCII码
*******************************************************************/
void find_asc(u32 address);

/*******************************************************************
函数名称:   write_lcd_buf_chinese
功能描述:   向LCD显示屏上写一个中文字符
*******************************************************************/
void write_lcd_buf_chinese(u8 page,u8 col);

/*******************************************************************
函数名称:   write_lcd_buf_ascii
功能描述:   向LCD显示屏上写一个ASCII码
*******************************************************************/
void write_lcd_buf_ascii(u8 page,u8 col);

/*******************************************************************
函数名称:   displayfirst
功能描述:   显示第一屏数据
参数:       lcd上的行显示位置
*******************************************************************/
void displayfirst(u8 lcdrow);

/*******************************************************************
函数名称:   displaysecond
功能描述:   显示第二屏数据
参数:       lcd上的行显示位置
*******************************************************************/
void displaysecond(u8 lcdrow);

/*******************************************************************
函数名称:   displaythird
功能描述:   显示第x块电能表的数据
参数:       Meter_Number: 表号
            elec:         电量
            date:         日期
            time:         时间
*******************************************************************/
void displaythird(u16 i,u8 *elec,u8 *date,u8 *time);

/*******************************************************************
函数名称:   Display_Date_Time
功能描述:   显示日期和时间
*******************************************************************/
void  Display_Date_Time(u8 * date, u8* time );

#endif
