#ifndef __LCD_H__
#define __LCD_H__
#include "71x_lib.h"

#define	LCD_CS_BIT 	(1UL<<10)	// GPIO  P1.10	LCD 片选线
#define	LCD_A0_BIT	(1UL<<9)	// GPIO  P1.9 	LCD命令或数据选择线
#define	LCD_SCL_BIT	(1UL<<8)	// GPIO  P1.8 	LCD时钟线
#define	LCD_SI_BIT	(1UL<<6)	// GPIO  P1.6	LCD数据线si

#define	LCD_CS 		10	// GPIO  P1.10	LCD 片选线
#define	LCD_A0		9	// GPIO  P1.9 	LCD命令或数据选择线
#define	LCD_SCL		8	// GPIO  P1.8 	LCD时钟线
#define	LCD_SI		6	// GPIO  P1.6	LCD数据线si

#define	LCD_COMMAND	0
#define	LCD_DATA	1

/***************************************************************************************
函数名称:   LCD_Init 
功能描述:   Lcd 初始化
***************************************************************************************/
void LCD_Init();

/***************************************************************************************
函数名称:   LCD_Write_Command
功能描述:   向液晶屏写命令
参数:	    一个字节的命令
***************************************************************************************/
void LCD_Write_Command(u8 lcd_command);

/***************************************************************************************
函数名称:   LCD_Write_Data
功能描述:   向液晶屏写数据
参数:       一个字节的数据
***************************************************************************************/
void LCD_Write_Data(u8 lcd_data);

/*****************************************************************************************
函数名称:   LCD_Show
功能描述:   向LCD显示屏送整屏的数据(指定内存区域中的内容)
参数:       lcd 缓冲区
*****************************************************************************************/
void	LCD_Show(u8 * lcd_buf_ptr);

/***************************************************************************************
函数名称:   Lcd_Display_XunXian
功能描述:   显示具体的屏数据
***************************************************************************************/
void 	Lcd_Display_XunXian();

/***************************************************************************************
函数名称:   Process_XunXian
功能描述:   处理循环显示
***************************************************************************************/
void	Process_XunXian();

/***************************************************************************************
函数名称:   LCD_Show_Time
功能描述:   处理循环显示的时间。
***************************************************************************************/
void	LCD_Show_Time(u8 * lcd_buf_ptr);

#endif
